ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/ICSSM_ICSSM_DRAM1_SLV_RAM_48002000h.xml
<module name="ICSSM_DRAM1_SLV_RAM" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="ICSSM_DRAM1_SLV_RAM_RAM_REG_j" acronym="ICSSM_DRAM1_SLV_RAM_RAM_REG_j" offset="0" width="32" description="The RAM memory words provide memory mapped random access data storage.">
		<bitfield id="BYTE3" width="8" begin="31" end="24" resetval="0x0" description="This is the MS byte" range="31:24" rwaccess="R/W"/>
	<bitfield id="BYTE2" width="8" begin="23" end="16" resetval="0x0" description="This is the UM byte" range="23:16" rwaccess="R/W"/>
	<bitfield id="BYTE1" width="8" begin="15" end="8" resetval="0x0" description="This is the LM byte" range="15:8" rwaccess="R/W"/>
	<bitfield id="BYTE0" width="8" begin="7" end="0" resetval="0x0" description="This is the LS byte" range="7:0" rwaccess="R/W"/>
	</register>
</module>